In [1]:
import os
import pandas as pd 
import numpy as np

In [10]:
data=os.path.join("data","netflix_titles.csv")

In [11]:
df=pd.read_csv(data)

In [12]:
df.head()

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,81145628,Movie,Norm of the North: King Sized Adventure,"Richard Finn, Tim Maltby","Alan Marriott, Andrew Toth, Brian Dobson, Cole...","United States, India, South Korea, China","September 9, 2019",2019,TV-PG,90 min,"Children & Family Movies, Comedies",Before planning an awesome wedding for his gra...
1,80117401,Movie,Jandino: Whatever it Takes,NaN,Jandino Asporaat,United Kingdom,"September 9, 2016",2016,TV-MA,94 min,Stand-Up Comedy,Jandino Asporaat riffs on the challenges of ra...
2,70234439,TV Show,Transformers Prime,NaN,"Peter Cullen, Sumalee Montano, Frank Welker, J...",United States,"September 8, 2018",2013,TV-Y7-FV,1 Season,Kids' TV,"With the help of three human allies, the Autob..."
3,80058654,TV Show,Transformers: Robots in Disguise,NaN,"Will Friedle, Darren Criss, Constance Zimmer, ...",United States,"September 8, 2018",2016,TV-Y7,1 Season,Kids' TV,When a prison ship crash unleashes hundreds of...
4,80125979,Movie,#realityhigh,Fernando Lebrija,"Nesta Cooper, Kate Walsh, John Michael Higgins...",United States,"September 8, 2017",2017,TV-14,99 min,Comedies,When nerdy high schooler Dani finally attracts...

In [13]:
df.columns

Index(['show_id', 'type', 'title', 'director', 'cast', 'country', 'date_added',
       'release_year', 'rating', 'duration', 'listed_in', 'description'],
      dtype='object')

In [14]:
df.dtypes

show_id          int64
type            object
title           object
director        object
cast            object
country         object
date_added      object
release_year     int64
rating          object
duration        object
listed_in       object
description     object
dtype: object

In [15]:
df.describe()

            show_id  release_year
count  6.234000e+03    6234.00000
mean   7.670368e+07    2013.35932
std    1.094296e+07       8.81162
min    2.477470e+05    1925.00000
25%    8.003580e+07    2013.00000
50%    8.016337e+07    2016.00000
75%    8.024489e+07    2018.00000
max    8.123573e+07    2020.00000

In [16]:
df.shape

(6234, 12)

In [17]:
df.type.unique()

array(['Movie', 'TV Show'], dtype=object)

In [18]:
df.country.unique()

array(['United States, India, South Korea, China', 'United Kingdom',
       'United States', 'Spain', 'Bulgaria, United States, Spain, Canada',
       'Chile', 'United States, United Kingdom, Denmark, Sweden', nan,
       'Netherlands, Belgium, United Kingdom, United States',
       'France, Belgium', 'United States, Uruguay', 'United States,',
       'Thailand', 'China, Canada, United States',
       'Belgium, United Kingdom, United States', 'Belgium, France',
       'India', 'France', 'United States, Canada', 'Pakistan', 'Canada',
       'United Kingdom, France', 'United States, United Kingdom',
       'South Korea', 'Denmark, United States',
       'United Kingdom, United States', 'Turkey, United States', 'Brazil',
       'Denmark, France, Italy, Belgium, Netherlands', 'Indonesia',
       'China', 'Ireland, United Kingdom', 'Turkey', 'Hong Kong',
       'France, Morocco', 'Hong Kong, China', 'Mexico',
       'United States, Mexico', 'Vietnam', 'France, Canada',
       'Spain, Argentina', 'Nigeria', 'Japan',
       'United Kingdom, Canada, United States',
       'United Kingdom, France, Germany, Spain',
       'United States, Greece, United Kingdom',
       'Norway, United Kingdom, France, Ireland',
       'France, Switzerland, Spain, United States, United Arab Emirates',
       'Canada, United States', 'Canada, United States, United Kingdom',
       'United States, United Kingdom, Canada, Japan',
       'Japan, Canada, South Korea', 'Lebanon', 'Ireland',
       'Cambodia, United States', 'Russia', 'United States, Denmark',
       'Poland', 'Israel, United States', 'Italy', 'Netherlands',
       'Brazil, United States', 'United States, France',
       'Germany, United States, Canada', 'United States, Australia',
       'Denmark, Brazil, France, Portugal, Sweden',
       'France, United States', 'United Arab Emirates', 'Egypt', 'Taiwan',
       'India, Germany, Austria', 'Australia', 'Czech Republic, France',
       'United States, Senegal', 'Norway', 'Germany',
       'India, Soviet Union', 'Argentina, Spain',
       'United States, Hong Kong',
       'United Kingdom, Italy, Israel, Peru, United States',
       'Argentina, Uruguay, Spain, France',
       'Germany, United States, Italy', 'Argentina',
       'Pakistan, Norway, United States', 'Switzerland',
       'United Kingdom, Ukraine, United States', 'Malaysia',
       'Australia, United States', 'Ireland, South Africa',
       'China, India, Nepal', 'Czech Republic, United States',
       'United Kingdom, Hong Kong', 'United Kingdom, Canada, Italy',
       'Spain, France', 'Philippines',
       'United Kingdom, India, United States',
       'France, Belgium, China, United States', 'Mexico, United States',
       'United States, Indonesia', 'United Kingdom, Germany, Canada',
       'Russia, Poland, Serbia', 'Serbia, United States',
       'Spain, Portugal', 'Colombia', 'United States, Czech Republic',
       'United States, United Kingdom, Germany', 'Singapore, Malaysia',
       'Canada, Luxembourg', 'United States, Spain, Germany',
       'Egypt, Austria, United States', 'Peru',
       'United Kingdom, United States, Morocco',
       'United States, Bulgaria', 'United Kingdom, West Germany',
       'Belgium, Luxembourg, France', 'Mexico, Argentina',
       'United Kingdom, Canada, United States, Cayman Islands',
       'United States, United Kingdom, Morocco',
       'Indonesia, United States', 'South Africa', 'United States, China',
       'Netherlands, Denmark, South Africa',
       'United Kingdom, Poland, United States', 'New Zealand',
       'Venezuela', 'United States, Spain',
       'Australia, United Arab Emirates', 'Australia, India',
       'India, Malaysia',
       'Canada, India, Thailand, United States, United Arab Emirates',
       'Italy, France', 'Germany, Jordan, Netherlands',
       'Turkey, France, Germany, Poland',
       'United States, Israel, United Kingdom, Canada', 'Saudi Arabia',
       'Egypt, France', 'Norway, Iceland, United States',
       'Denmark, France, Poland', 'United States, Germany, Canada',
       'United States, Germany', 'Poland,',
       'United States, United Kingdom, Australia', 'Poland, West Germany',
       'Germany, United States', 'United Kingdom, France, United States',
       'United States, Malta, United Kingdom', 'United States, Sweden',
       'India, United States', 'India, Australia',
       'France, Canada, Belgium', 'United States, Italy',
       'United States, Brazil', 'Canada, Ireland, United States',
       'United States, France, Canada, Lebanon, Qatar',
       'Switzerland, France', 'France, United Kingdom', 'Norway, Germany',
       'United Kingdom, Canada, Japan', 'United States, Russia',
       'Chile, United States, France', 'United States, Japan',
       'Brazil, France', 'Iceland',
       'United States, United Kingdom, Canada', 'Argentina, Chile',
       'United Kingdom,', 'China, Hong Kong',
       'South Africa, United States, New Zealand, Canada', 'Austria',
       'Poland, United States', 'Ireland, Canada',
       'Italy, Switzerland, France, Germany', 'Mexico, Netherlands',
       'Peru, United States, United Kingdom', 'France, Senegal, Belgium',
       'Germany, Canada, United States', 'Canada, Norway',
       'China, Morocco, Hong Kong', 'Uruguay',
       'United States, United Arab Emirates',
       'Spain, Belgium, Switzerland, United States, China, United Kingdom',
       'Singapore, United States',
       'United Kingdom, Germany, Canada, United States',
       'Australia, Canada', 'Australia, France',
       'Germany, United Kingdom', 'Italy, United States',
       'United States, New Zealand, United Kingdom',
       'United Kingdom, Germany, United States',
       'United States, Australia, Mexico',
       'United States, South Korea, Japan', 'France, Iran, United States',
       'United Kingdom, Australia, Canada, United States',
       'France, Qatar', 'Finland, Germany, Belgium',
       'United States, Spain, Chile, Peru',
       'United Arab Emirates, United States, United Kingdom',
       'United States, Ireland', 'Australia, Iraq',
       'Argentina, United States, Mexico', 'Denmark',
       'Germany, France, Russia',
       'United States, Italy, United Kingdom, Liechtenstein',
       'Hong Kong, United States', 'United States, United Kingdom, Italy',
       'United States, France, Canada, Spain', 'Italy, Belgium, France',
       'United States, United Kingdom, France', 'United Kingdom, India',
       'New Zealand, United Kingdom, Australia',
       'United Kingdom, China, United States', 'Pakistan, United States',
       'Canada, India', 'India, Canada', 'Singapore',
       'United States, Canada, United Kingdom', 'Mexico, France',
       'United Kingdom, Belgium, Sweden', 'United States, India',
       'Canada, Japan, United States',
       'Italy, Switzerland, Albania, Poland', 'Colombia, United States',
       'United Kingdom, Thailand', 'Belgium, Netherlands',
       'United Kingdom, Israel, Russia', 'United Kingdom, South Africa',
       'United States, South Korea, China', 'Cambodia', 'Denmark, Spain',
       'Spain, Mexico, France', 'Argentina, Italy',
       'United Kingdom, Pakistan',
       'Denmark, France, United States, Sweden',
       'Colombia, Mexico, United States', 'Czech Republic, Slovakia',
       'Chile, Argentina', 'India, Germany, France',
       'Spain, France, Uruguay', 'South Korea, Czech Republic',
       'Italy, United States, Argentina', 'United States, South Africa',
       'Singapore, France',
       'United States, Australia, Samoa, United Kingdom',
       'Spain, Switzerland', 'United Arab Emirates, Jordan',
       'United Kingdom, Canada, France, United States',
       'United States, Chile', 'Bulgaria, United States',
       'Norway, Germany, Sweden', 'India, Japan',
       'Austria, United States', 'Ghana, United States',
       'United Kingdom, Spain, United States, Germany',
       'United States, Cambodia', 'Mexico, Finland',
       'Canada, United States, India, United Kingdom',
       'Philippines, Qatar', 'Netherlands, Belgium, Germany, Jordan',
       'Venezuela, Colombia',
       'Brazil, Netherlands, United States, Colombia, Austria, Germany',
       'Austria, Iraq, United States',
       'Denmark, United Kingdom, South Africa, Sweden, Belgium',
       'United States, Botswana', 'Iran, France',
       'United Arab Emirates, United States', 'Belgium',
       'United Kingdom, Japan, United States',
       'United Arab Emirates, United Kingdom, India',
       'United States, Taiwan',
       'United Kingdom, United States, Czech Republic', 'Sweden',
       'Hungary', 'India, France', 'India, Germany', 'Guatemala',
       'Portugal, Spain', 'Taiwan, Hong Kong, United States, China',
       'United Kingdom, Malawi', 'Paraguay, Argentina',
       'Somalia, Kenya, Sudan, South Africa, United States',
       'Germany, Sri Lanka', 'Ukraine', 'Uruguay, Spain, Mexico',
       'France, Luxembourg, Canada', 'Spain, France, Italy',
       'France, China, Japan, United States',
       'United Kingdom, France, Canada, Belgium, United States',
       'Colombia, Mexico', 'Dominican Republic',
       'South Korea, United States', 'Israel',
       'Chile, Argentina, France, Spain, United States', 'Russia, Spain',
       'Netherlands, United States', 'Thailand, China, United States',
       'United States, Canada, Ireland', 'United States, Iceland',
       'Argentina, United States',
       'United States, France, United Kingdom, Japan',
       'United Kingdom, United States, Australia',
       'Germany, United States, Sweden',
       'United States, Canada, Japan, Panama', 'Sweden, United States',
       'Chile, Peru', 'Israel, Sweden, Germany, Netherlands',
       'Lebanon, Jordan', 'Romania',
       'Denmark, Sweden, Israel, United States',
       'Switzerland, United States',
       'Finland, Sweden, Norway, Latvia, Germany',
       'France, United Kingdom, India', 'Italy, France, Switzerland',
       'France, Luxembourg, United States', 'India, United Kingdom',
       'China, Hong Kong, United States', 'Singapore, Japan, France',
       'United Kingdom, Poland', 'Philippines, Singapore',
       'United States, China, Hong Kong',
       'Canada, Mexico, Germany, South Africa',
       'United Kingdom, New Zealand',
       'United States, Brazil, India, Uganda, China',
       'United Kingdom, Germany', 'China, United States, United Kingdom',
       'Slovenia, Croatia, Germany, Czech Republic, Qatar',
       'Germany, Australia', 'China, United States, Australia',
       'Russia, United States',
       'Ireland, Canada, United Kingdom, United States',
       'Australia, United Kingdom, Canada', 'Canada, Spain, France',
       'United Kingdom, Denmark, Canada, Croatia',
       'Argentina, France, Germany',
       'Switzerland, United Kingdom, United States',
       'Argentina, Chile, Peru',
       'Germany, France, Luxembourg, United Kingdom, United States',
       'Taiwan, China, France, United States', 'Germany, Italy',
       'Denmark, United Kingdom',
       'Germany, United Kingdom, United States',
       'United States, Czech Republic, United Kingdom',
       'Hong Kong, Taiwan', 'Croatia, Slovenia, Serbia, Montenegro',
       'United States, France, Italy, United Kingdom', 'Bangladesh',
       'India, Nepal', 'United Kingdom, Jordan, Qatar, Iran',
       'Norway, Denmark, Sweden', 'Iceland, Sweden, Belgium',
       'United States, India, United Arab Emirates', 'India, Pakistan',
       'Switzerland, Vatican City, Italy, Germany, France',
       'Indonesia, Singapore',
       'United Kingdom, United States, Spain, Germany, Greece, Canada',
       'Spain, Belgium', 'Spain, United Kingdom, United States',
       'United States, United Kingdom, France, Germany, Japan',
       'United Kingdom, Egypt, United States',
       'United States, India, Malaysia, Taiwan, Canada, United Kingdom',
       'United Kingdom, Spain, Belgium',
       'Germany, United States, United Kingdom, Canada',
       'Soviet Union, India',
       'Ireland, United Kingdom, Italy, United States',
       'Austria, Czech Republic', 'United Kingdom, Ireland',
       'United States, Greece, Brazil', 'Lebanon, Qatar',
       'Italy, South Africa, West Germany, Australia, United States',
       'United Kingdom, United States, Dominican Republic',
       'Brazil, India, China, United States',
       'Indonesia, South Korea, Singapore',
       'United States, Canada, France', 'Brazil, France, Germany',
       'United States, France, Mexico', 'United States, South Korea',
       'United States, Canada, Germany', 'Mexico, Spain',
       'Germany, France, United States, Canada, United Kingdom',
       'Australia, United Kingdom',
       'United States, Germany, United Kingdom',
       'United States, Germany, United Kingdom, Italy',
       'New Zealand, United States', 'United States, Germany, Mexico',
       'South Africa, United States',
       'United States, East Germany, West Germany',
       'France, United States, Mexico', 'United Kingdom, Brazil, Germany',
       'United States, India, Bangladesh', 'Germany, Belgium',
       'Canada, France, Italy, Morocco, United States',
       'Denmark, Germany, Belgium, United Kingdom, France',
       'Belgium, Ireland, Netherlands, Germany, Afghanistan',
       'United States, Venezuela', 'Canada, United Kingdom, Netherlands',
       'United States, France, Japan', 'United States, New Zealand',
       'United States, New Zealand, Japan',
       'United States, Netherlands, Japan, France',
       'France, United States, Canada', 'United Kingdom, Canada',
       'Georgia', 'New Zealand, United Kingdom', 'Italy, India',
       'Belgium, India, Australia',
       'United States, Canada, Belgium, United Kingdom',
       'United States, Spain, Italy', 'Serbia, South Korea, Slovenia',
       'France, Netherlands, South Africa, Finland',
       'China, United States',
       'Denmark, Indonesia, Finland, Norway, United Kingdom, Israel, France, United States, Germany, Netherlands',
       'Netherlands, Denmark, France, Germany',
       'Ireland, Canada, Luxembourg, United States',
       'Spain, Italy, Argentina',
       'United States, Israel, Italy, South Africa',
       'United Kingdom, United States, Russia',
       'United Kingdom, France, Germany',
       'Czech Republic, United Kingdom, France',
       'Chile, Spain, Argentina, Germany',
       'Australia, United Kingdom, United States, New Zealand, Italy, France',
       'United Kingdom, Namibia, South Africa, Zimbabwe, United States',
       'France, Germany, Switzerland', 'West Germany',
       'United Kingdom, United States, France, Germany', 'Denmark, China',
       'France, Germany, Czech Republic, Belgium',
       'South Africa, Germany, Netherlands, France',
       'China, South Korea, United States', 'Spain, Cuba',
       'United States, Hungary', 'France, Germany', 'Israel, Germany',
       'South Korea, Canada, United States, China',
       'Italy, Canada, France', 'Thailand, United States',
       'Japan, United States', 'Uruguay, Argentina, Spain',
       'Sweden, Netherlands', 'Argentina, Uruguay, Serbia',
       'France, Poland', 'Turkey, Azerbaijan', 'France, Japan',
       'Australia, United Kingdom, United Arab Emirates, Canada',
       'Ireland, United Kingdom, United States',
       'Mauritius, South Africa',
       'United Kingdom, Italy, Argentina, United States',
       'France, South Korea, Japan', 'Australia, France, Ireland',
       'Ireland, United Kingdom, Greece, France, Netherlands',
       'Canada, Germany, South Africa', 'Thailand, Canada, United States',
       'United Kingdom, United States, Germany, Denmark, Belgium, Japan',
       'Canada, Germany, France, United States', 'Ghana',
       'United States, Nicaragua', 'South Korea, China, United States',
       'Israel, Germany, France', 'Brazil, Canada',
       'Canada, France, United States', 'Canada, Japan, Netherlands',
       'United Kingdom, India, Sweden',
       'India, United Kingdom, Canada, United States',
       'Sweden, United Kingdom, Finland', 'Romania, Bulgaria, Hungary',
       'Norway, Denmark, Netherlands, Sweden',
       'Hong Kong, China, United States', 'Canada, France',
       'India, Mexico', 'Georgia, Germany, France', 'India, Switzerland',
       'United Arab Emirates, Romania', 'United States, Kazakhstan',
       'Malaysia, Singapore, Hong Kong', 'France, China, Canada',
       'China, Japan', 'United Kingdom, France, Belgium, United States',
       'China, United Kingdom', 'Spain, Germany', 'Canada, Spain',
       'France, Belgium, Spain',
       'Denmark, Germany, Belgium, United Kingdom, France, Sweden',
       'China, Taiwan',
       'Israel, Germany, Poland, Luxembourg, Belgium, France, United States',
       'Finland, Germany', 'India, Turkey',
       'United Kingdom, France, Belgium', 'Spain, Mexico',
       'Australia, Armenia, Japan, Jordan, Mexico, Mongolia, New Zealand, Philippines, South Africa, Sweden, United States, Uruguay',
       'United States, Argentina', 'United States, Bermuda, Ecuador',
       'India, Iran', 'United Kingdom, South Korea',
       'United States, Germany, Australia', 'Argentina, France',
       'Germany, United States, Hong Kong, Singapore', 'Chile, France',
       'South Africa, China, United States', 'Netherlands, Belgium',
       'United States, Morocco', 'Spain, Colombia',
       'United Kingdom, South Africa, Australia, United States',
       'Bulgaria', 'Turkey, India', 'Italy, Turkey',
       'Saudi Arabia, Syria, Egypt, Lebanon, Kuwait',
       'Hong Kong, China, Singapore',
       'Canada, United Kingdom, United States',
       'United States, Australia, China', 'Australia, New Zealand',
       'United Kingdom, Norway, Denmark, Germany, Sweden',
       'South Africa, United States, Germany', 'Denmark, Zimbabwe',
       'United States, Australia, South Africa, United Kingdom',
       'China, Germany, India, United States',
       'United Kingdom, United States, Greece, Italy, Germany',
       'Portugal, France, Poland, United States',
       'United Kingdom, China, Canada, Indonesia, Singapore, United States',
       'United Kingdom, Singapore', 'France, Netherlands, Singapore',
       'Ireland, United States, France', 'Pakistan, United Arab Emirates',
       'Argentina, Brazil, France, Poland, Germany, Denmark',
       'United States, United Kingdom, Spain, South Korea',
       'United Kingdom, Italy, France, United States',
       'United Kingdom, Russia',
       'United States, France, South Korea, Indonesia',
       'United States, Colombia, Mexico',
       'United States, Ireland, United Kingdom',
       'Australia, New Zealand, United States',
       'France, United Kingdom, United States',
       'United States, France, Canada', 'Canada, United Kingdom',
       'United States, Spain, Colombia, Mexico', 'Norway, United States',
       'Canada, Australia', 'United States, Mexico, Spain, Malta',
       'United States, Japan, Canada', 'Canada, Brazil',
       'Canada, United States, France', 'South Korea, France',
       'Japan, Canada', 'Finland',
       'Ireland, Canada, United States, United Kingdom',
       'Italy, United Kingdom, France', 'United States, Colombia',
       'Spain, United Kingdom', 'Netherlands, Germany, Italy, Canada',
       'Croatia', 'Finland, France',
       'Denmark, Singapore, Canada, United States',
       'United States, Hungary, Ireland, Canada', 'Norway, Sweden',
       'United States, Mexico, Colombia',
       'United States, Brazil, South Korea, Mexico, Japan, Germany',
       'Italy, Germany', 'Cyprus, Austria, Thailand'], dtype=object)

In [19]:
df['type'].unique()

array(['Movie', 'TV Show'], dtype=object)

In [20]:
df.type.value_counts()

Movie      4265
TV Show    1969
Name: type, dtype: int64

In [21]:
a=np.random.randint(0,10,size=(5))

In [22]:
a

array([6, 7, 8, 0, 2])

In [24]:
s=pd.Series(a)

In [25]:
s

0    6
1    7
2    8
3    0
4    2
dtype: int64

In [26]:
labels=['a','b','c','d','e']
a=np.random.randint(0,10,size=(5))
s=pd.Series(a,index=labels)
s

a    9
b    9
c    4
d    9
e    3
dtype: int64

In [29]:
print("s[0]:\n {}\n type:\n{}".format(s[0],type(s['a'])))

s[0]:
 9
 type:
<class 'numpy.int64'>

In [30]:
a=['A','B','C','D','E']
b=np.random.randint(1,45,size=(5))

In [31]:
a

['A', 'B', 'C', 'D', 'E']

In [32]:
b

array([12,  8, 37, 42, 42])

In [33]:
df=pd.DataFrame({"name":a,"balance":b})

In [34]:
df.head()

  name  balance
0    A       12
1    B        8
2    C       37
3    D       42
4    E       42

In [35]:
df.name

0    A
1    B
2    C
3    D
4    E
Name: name, dtype: object

In [36]:
df['name']

0    A
1    B
2    C
3    D
4    E
Name: name, dtype: object

In [37]:
type(df.name)

pandas.core.series.Series

In [38]:
df['name'][0]

'A'

In [39]:
df['name'][4]

'E'

In [40]:
df.iloc[:2,:]

  name  balance
0    A       12
1    B        8

In [41]:
df.iloc[:2,:1]

  name
0    A
1    B

In [44]:
df['name'].iloc[:3]

0    A
1    B
2    C
Name: name, dtype: object

In [45]:
df.loc[:,['balance']]

   balance
0       12
1        8
2       37
3       42
4       42

In [46]:
df.balance>30

0    False
1    False
2     True
3     True
4     True
Name: balance, dtype: bool

In [47]:
df.loc[df.balance>30]

  name  balance
2    C       37
3    D       42
4    E       42

In [48]:
df['name']=df['name'].map(lambda x: "a01"+ x)

In [49]:
df

   name  balance
0  a01A       12
1  a01B        8
2  a01C       37
3  a01D       42
4  a01E       42

In [50]:
def example_function(x):
    return "from example "+ x
df['name']=df['name'].map(example_function)
df

                name  balance
0  from example a01A       12
1  from example a01B        8
2  from example a01C       37
3  from example a01D       42
4  from example a01E       42

In [51]:
def example_function(row):
    row['new_balance']=int(row.balance)+10
    return row

df.apply(example_function, axis='columns')

                name  balance  new_balance
0  from example a01A       12           22
1  from example a01B        8           18
2  from example a01C       37           47
3  from example a01D       42           52
4  from example a01E       42           52